/**************************************************************************/
/*!
    @file     errors.h
    @author   K. Townsend (Adafruit Industries)

    @section LICENSE
    (版权声明保留英文...)
*/
/**************************************************************************/
#ifndef _ERRORS_H_
#define _ERRORS_H_

typedef enum
{
  /*=======================================================================
    通用错误                                               0x0000 .. 0x00FF
    -----------------------------------------------------------------------
    这些错误代码可以在系统中的任何地方使用
    -----------------------------------------------------------------------*/
    ERROR_NONE                   = 0x0,  /**< 表示没有发生错误 */
    ERROR_OPERATIONTIMEDOUT      = 0x1,  /**< 操作在完成前超时 */
    ERROR_ADDRESSOUTOFRANGE      = 0x2,  /**< 提供的地址超出范围 */
    ERROR_BUFFEROVERFLOW         = 0x3,  /**< 拟议的操作将导致缓冲区溢出 */
    ERROR_INVALIDPARAMETER       = 0x4,  /**< 提供了无效的参数值 */
    ERROR_DEVICENOTINITIALISED   = 0x5,  /**< 试图在未初始化的外设上执行函数 */
    ERROR_UNEXPECTEDVALUE        = 0x6,  /**< 在函数内部发现了意外的值 */
  /*=======================================================================*/


  /*=======================================================================
    I2C 错误                                               0x0100 .. 0x010F
    -----------------------------------------------------------------------
    与 I2C 总线相关的错误
    -----------------------------------------------------------------------*/
    ERROR_I2C_DEVICENOTFOUND     = 0x101,  /**< I2C 传输后设备未应答 (ACK) */
    ERROR_I2C_NOACK              = 0x102,  /**< I2C 传输期间未收到 ACK 信号 */
    ERROR_I2C_TIMEOUT            = 0x103,  /**< 设备等待响应超时 (缺少上拉电阻？) */
  /*=======================================================================*/
} err_t;

#endif

